
//====================================
//
//	テクスチャ管理
//
//テクスチャロードの簡略化
//重複した画像はロードしない
//
//====================================

#pragma once

#include	"renderer.h"
#include	"main.h"

//=============================
//マクロ定義
//=============================

//=============================
//グローバル変数
//=============================

//=============================
//プロトタイプ宣言
//=============================

//テクスチャのロード
int		LoadTexture(char* filename);

//全てのテクスチャの解放
void	UninitTexture();

//指定のテクスチャ情報を取得
ID3D11ShaderResourceView**	GetTexture(int index);



