//==============================================
//
//	[.h]
//	Author	:	恩田洋行
//	Date	:
//==============================================
#pragma once

//==============================================
//	インクルード
//==============================================
#include "main.h"

//==============================================
//	マクロ定義
//==============================================

//==============================================
//	構造体定義
//==============================================
typedef struct
{
	D3DXVECTOR3 Position;	//表示座標
	D3DXCOLOR Color;		//表示色
	float Rotation;			//角度
	D3DXVECTOR2 Size;		//ポリゴンのサイズ

	float PaternNo;			//パターン番号
	float u;				//横サイズ
	float v;				//縦サイズ
	int NumPatern;			//横枚数

}BG;

//==============================================
//	プロトタイプ宣言
//==============================================
HRESULT InitBgGame(void);
void UninitBgGame(void);
void UpdateBgGame(void);
void DrawBgGame(void);
