//==============================================
//
//	[.h]
//	Author	:	恩田洋行
//	Date	:
//==============================================
#pragma once

//==============================================
//インクルード
//==============================================

//==============================================
//マクロ定義
//==============================================
//シーン番号
enum SCENE
{
	SCENE_NONE = 0,		//シーン無し
	SCENE_TITLE,		//タイトル
	SCENE_GAME,			//ゲーム
	SCENE_RESULT,		//結果画面

	SCENE_MAX			//一番最後
};

//==============================================
// 構造体定義
//==============================================

//==============================================
// プロトタイプ宣言
//==============================================
void	InitScene(SCENE no);
void	UninitScene();
void	UpdateScene();
void	DrawScene();

void	SetScene(SCENE no);	//新しいシーンをセットしてリクエストする
void	CheckScene();		//シーン切り替えのリクエストをチェックする


