//==========================================================
//
//   スプライト描画 [sprite.h]
//									 Author :
//									 Date   :
//==========================================================
#pragma once

#include "main.h"

//==========================================================
//マクロ定義
//==========================================================


//==========================================================
//プロトタイプ宣言
//外部のプログラムに公開して使ってもらう関数
//==========================================================
void	DrawSpriteColorRotation(float, float, int, int, float, D3DXCOLOR,
	static	float PaternNo, float uv_w, float uv_h, int NumPatern);
void	InitSprite();	//スプライト初期化
void	UninitSprite();	//スプライト終了処理


