//=======================================
// ステージ選択画面関係(cppファイル)
// 作成日：2022/11/29
// 作成者：高梨水希
//=======================================

#include "stage_select.h"

//==========================
// デフォルトコンストラクタ
//==========================
StageSelect::StageSelect()
{
	//スコアを初期化
	for (int i = 0; i < STAGE_NUM; i++) {
		m_stage_score[i] = 0;
	}
}

//==========================
// 引数付きコンストラクタ
//==========================
StageSelect::StageSelect(int stage_score[])
{
	//スコアを初期化
	for (int i = 0; i < STAGE_NUM; i++) {
		m_stage_score[i] = stage_score[i];
	}
}

//==========================
// 更新処理
//==========================
void StageSelect::Update(void)
{
}

//==========================
// 描画処理
//==========================
void StageSelect::Draw(void) const
{
}