//=======================================
// スコア表示関係(cppファイル)
// 作成日：2022/12/16
// 作成者：高梨水希
//=======================================
#include "title_score.h"

//==========================
// 引数付きコンストラクタ
//==========================
TitleScore::TitleScore(Score* pNumber, int score[]):m_pScore(pNumber)
{
	//スコアの初期化
	for (int i = 0; i < STAGE_NUM; i++) {
		m_score[i] = score[i];
	}
}

//==========================
// 更新処理
//==========================
void TitleScore::Update(void)
{
}

//==========================
// 描画処理
//==========================
void TitleScore::Draw(void)
{
}
